<?php
// +----------------------------------------------------------------------
// | thinkphp5 Addons [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 2016 http://www.zzstudio.net All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: Byron Sampson <xiaobo.sun@qq.com>
// +----------------------------------------------------------------------

return [
    'autoload' => true,
    'hooks' => [
	    // 可以定义多个钩子
	    'testhook'=>'test', // 键为钩子名称，用于在业务中自定义钩子处理，值为实现该钩子的插件，
	    // 多个插件可以用数组也可以用逗号分
	    'payhook'=>'pay'
	],
    'route' => [],
    'service' => [],
];