<?php
// +----------------------------------------------------------------------
// | Json状态码描述
// +----------------------------------------------------------------------

return [
    '100'  => '操作成功',

    //权限错误（前后，对外：权限错误）
    '101'  => '没有操作权限',
    '102'  => '不允许GET请求',
    '103'  => '不允许POST请求',
    '104'  => '当前用户不存在',
    '105'  => '请输入正确account、password',
    '106'  => '当前账号未登录',
    '107'  => '当前账号已被禁用',
    '108'  => '账号不存在',

    //系统错误（前后，对外：系统错误+错误码）
    '300'  => '', //自定义错误信息
    '301'  => '系统错误，错误码301',

    '1000' => '登录错误',
    '2000' => '增加错误',
    '3000' => '修改错误',
    '4000' => '删除错误',
    '5000' => '当前操作错误,json返回数据为空',
];
